Revit 2024 API
BuiltInFailures.RebarFailures.NoVisibleRebarHandle Property
 Editing of the constraints for the selected rebar with free form geometry is not available. However, the default automatic constraints may still work.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId NoVisibleRebarHandle { get; }
Visual Basic
Public Shared ReadOnly Property NoVisibleRebarHandle As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ NoVisibleRebarHandle {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.RebarFailures Class
Autodesk.Revit.DB Namespace